//****************************************************************************************************
//подключаемые библиотеки
//****************************************************************************************************
#include "crecord.h"

#include <deque>

//****************************************************************************************************
//глобальные переменные
//****************************************************************************************************

//****************************************************************************************************
//константы
//****************************************************************************************************

//****************************************************************************************************
//макроопределения
//****************************************************************************************************

//****************************************************************************************************
//конструктор и деструктор
//****************************************************************************************************

//----------------------------------------------------------------------------------------------------
//!конструктор
//----------------------------------------------------------------------------------------------------
CRecord::CRecord(void)
{
 Name.clear();
 FileList.clear();
 RecordList.clear();
 State=CFile::STATE::STATE_EQUIVALENT;
}
//----------------------------------------------------------------------------------------------------
//!деструктор
//----------------------------------------------------------------------------------------------------
CRecord::~CRecord()
{
}

//****************************************************************************************************
//закрытые функции
//****************************************************************************************************

//****************************************************************************************************
//открытые функции
//****************************************************************************************************

//----------------------------------------------------------------------------------------------------
//!сохранить
//----------------------------------------------------------------------------------------------------
void CRecord::Save(FILE *file) const
{
 uint64_t size=Name.size();
 fwrite(&size,sizeof(uint64_t),1,file);
 fwrite(Name.c_str(),size,1,file);

 size=FileList.size();
 fwrite(&size,sizeof(uint64_t),1,file);
 for(size_t n=0;n<size;n++) FileList[n].Save(file);

 size=RecordList.size();
 fwrite(&size,sizeof(uint64_t),1,file);
 for(size_t n=0;n<size;n++) RecordList[n].Save(file);
}
//----------------------------------------------------------------------------------------------------
//!загрузить
//----------------------------------------------------------------------------------------------------
bool CRecord::Load(FILE *file)
{
 Name.clear();
 FileList.clear();
 RecordList.clear();
 State=CFile::STATE::STATE_EQUIVALENT;

 uint64_t size;

 if (fread(&size,sizeof(uint64_t),1,file)==0) return(false);
 Name.resize(size);
 if (fread(const_cast<char*>(Name.c_str()),sizeof(char),size,file)==0) return(false);

 if (fread(&size,sizeof(uint64_t),1,file)==0) return(false);
 if (size>0)
 {
  FileList.resize(size,CFile());
  for(size_t n=0;n<size;n++)
  {
   if (FileList[n].Load(file)==false) return(false);
  }
 }
 if (fread(&size,sizeof(uint64_t),1,file)==0) return(false);
 if (size>0)
 {
  RecordList.resize(size,CRecord());

  for(size_t n=0;n<size;n++)
  {
   if (RecordList[n].Load(file)==false) return(false);
  }
 }
 return(true);
}
//----------------------------------------------------------------------------------------------------
//!получить размер
//----------------------------------------------------------------------------------------------------
size_t CRecord::GetSize(void) const
{
 size_t size=0;
 for(size_t n=0;n<FileList.size();n++) size+=FileList[n].GetSize();
 for(size_t n=0;n<RecordList.size();n++) size+=RecordList[n].GetSize();
 return(size);
}
//----------------------------------------------------------------------------------------------------
//!получить размер в несжатом TAR-архиве
//----------------------------------------------------------------------------------------------------
size_t CRecord::GetTARSize(void) const
{
 size_t size=0;
 size+=CFile::TAR_BLOCK_SIZE;//имя директории
 for(size_t n=0;n<FileList.size();n++) size+=FileList[n].GetTARSize();
 for(size_t n=0;n<RecordList.size();n++) size+=RecordList[n].GetTARSize();
 return(size);
}
//----------------------------------------------------------------------------------------------------
//!задать статус всей записи и её элементам
//----------------------------------------------------------------------------------------------------
void CRecord::SetState(CFile::STATE state)
{
 State=state;
 for(size_t n=0;n<FileList.size();n++) FileList[n].State=state;
 for(size_t n=0;n<RecordList.size();n++) RecordList[n].SetState(state);
}
//----------------------------------------------------------------------------------------------------
//!отметить каталоги в которых есть отличающиеся элементы
//----------------------------------------------------------------------------------------------------
bool CRecord::MarkNotEuqivalentDirectory(void)
{
 bool not_equivalent=false;
 for(size_t n=0;n<FileList.size();n++)
 {
  if (FileList[n].State!=CFile::STATE::STATE_EQUIVALENT)
  {
   not_equivalent=true;
   break;
  }
 }
 for(size_t n=0;n<RecordList.size();n++)
 {
  if (RecordList[n].MarkNotEuqivalentDirectory()==true) not_equivalent=true;
 }
 if (State==CFile::STATE::STATE_EQUIVALENT)
 {
  if (not_equivalent==true) State=CFile::STATE::STATE_DIRECTORY_NOT_EQUIVALENT;
 }
 return(not_equivalent);
}

