#ifndef C_STREAMER_H
#define C_STREAMER_H

//****************************************************************************************************
//\fileКласс стримера
//****************************************************************************************************

//****************************************************************************************************
//подключаемые библиотеки
//****************************************************************************************************

#include <stdint.h>
#include <string>

#include "ccommand.h"

//****************************************************************************************************
//макроопределения
//****************************************************************************************************

//****************************************************************************************************
//константы
//****************************************************************************************************

//****************************************************************************************************
//предварительные объявления
//****************************************************************************************************

//****************************************************************************************************
//!Класс стримера
//****************************************************************************************************
class CStreamer
{
 public:
  //-перечисления---------------------------------------------------------------------------------------
  //-структуры------------------------------------------------------------------------------------------
  //-константы------------------------------------------------------------------------------------------
 private:
  //-переменные-----------------------------------------------------------------------------------------
  CCommand cCommand_Eject;///<команда выгрузки кассеты
  CCommand cCommand_Load;///<команда загрузки кассеты
  CCommand cCommand_MoveToBegin;///<команда перемотки в начало
  CCommand cCommand_MoveToEndRecords;///<команда перевотки в конец записей
  CCommand cCommand_Erase;///<команда стирания кассеты
  CCommand cCommand_MoveToRecord;///<команда перемотки к записи
  CCommand cCommand_WriteToCassete;///<команда записи на кассету
  CCommand cCommand_ReadFromCassete;///<команда чтения с кассеты
 public:
  //-конструктор----------------------------------------------------------------------------------------
  CStreamer(void);
  //-деструктор-----------------------------------------------------------------------------------------
  ~CStreamer();
 public:
  //-открытые функции-----------------------------------------------------------------------------------
  bool Eject(void);///<выгрузить кассету
  bool Load(void);///<загрузить кассету
  bool MoveToBegin(void);///<перемотать в начало
  bool MoveToEndRecords(void);///<перемотать в конец записей
  bool Erase(void);///<стереть кассету
  bool MoveToRecord(size_t index);///<перемотать к записи
  bool WriteToCassete(std::string &path);///<записать на кассету
  bool ReadFromCassete(void);///<считать с кассеты

  void SetCommand_Eject(const std::string &command,const std::string &device_file);///<задать команду выгрузки кассеты
  void SetCommand_Load(const std::string &command,const std::string &device_file);///<задать команду загрузки кассеты
  void SetCommand_MoveToBegin(const std::string &command,const std::string &device_file);///<задать команду перемотки в начало
  void SetCommand_MoveToEndRecords(const std::string &command,const std::string &device_file);///<задать команду перевотки в конец записей
  void SetCommand_Erase(const std::string &command,const std::string &device_file);///<задать команду стирания кассеты
  void SetCommand_MoveToRecord(const std::string &command,const std::string &device_file);///<задать команду перемотки к записи
  void SetCommand_WriteToCassete(const std::string &command,const std::string &device_file);///<задать команду записи на кассету
  void SetCommand_ReadFromCassete(const std::string &command,const std::string &device_file);///<задать команду чтения с кассеты
 private:
  //-закрытые функции-----------------------------------------------------------------------------------  
  bool SendCommand(const std::string &command);///<послать команду стримеру
};

#endif
